#include <iostream>

using namespace std;

int main() {

    // 제약조건 : 첫번째 스텝과 마지막 스텝 길이는 무조건 1이 되어야한다.
    // 이 경우 두번째 스텝의 범위 => 1, 2
    // 마지막 스텝 전의 범위 => 1, 2
    // k1 = {1}, k2 = {1, 2} ... , kn-1 = {1, 2}, kn = {1}
    
    // f(k, l) => f(1, 3) = 1
    //         => f(2, 3) = 1
    //         => f(3, 3) = 1

    // f(k, l) => f(1, 4) = 1
    //         => f(2, 4) = 2
    //         => f(3, 4) = 1

    // f(k, l) => f(1, 5) = 1
    //         => f(2, 5) = 1
    //         => f(3, 5) = 2
    //         => f(4, 5) = 1

    // f(k, l) => f(1, 10) = 1
    //         => f(2, 10) = 2
    //         => f(3, 10) = 3
    //         => f(4, 10) = 2
    //         => f(5, 10) = 1
    //         => f(6, 10) = 1

    return 0;
}